[
  {
    "id": 1,
    "title": "HYLLS MUSIC",
    "subtitle": "Backend",
    "image": "1.png",
    "description": "Plataforma musical desarrollada con TypeScript, Node.js, TypeORM y MySQL, orientada a la gestión, distribución y promoción de artistas. Implementé autenticación JWT, relaciones complejas entre entidades (artistas, álbumes, playlists), subida de imágenes y videos, y control de contenido mediante APIs. Diseñada para facilitar la visibilidad de nuevos talentos musicales en un entorno seguro y escalable.",
    "link": "https://github.com/juan1214s/back-hylls"
  },
  {
    "id": 2,
    "title": "Mecánica a Domicilio",
    "subtitle": "Backend",
    "image": "2.png",
    "description": "API backend desarrollada con NestJS, TypeScript y MySQL para una plataforma de servicios mecánicos. Implementa autenticación segura con JWT, encriptación de contraseñas con bcrypt y envío de correos automáticos mediante Nodemailer. Diseñada para facilitar la administración de clientes, vehículos, servicios y desvare a domicilio, garantizando una integración eficiente con el frontend.",
    "link": "https://github.com/juan1214s/Mecanica-backend"
  },
  {
    "id": 3,
    "title": "API Ecommerce",
    "subtitle": "Backend",
    "image": "3.png",
    "description": "Backend en desarrollo para una tienda online, construido con Node.js, Express, MySQL y Multer para la gestión de productos e imágenes. Integra autenticación JWT, control de acceso por roles y pagos seguros mediante la API de Stripe. Permite registrar productos con múltiples imágenes, gestionar inventario y procesar pagos, sentando las bases para un sistema de ventas completo, escalable y seguro.",
    "link": "https://github.com/juan1214s/JMS-tienda"
  },
  {
    "id": 4,
    "title": "Oprocess",
    "subtitle": "Landing page",
    "image": "4.png",
    "description": "Landing page desarrollada con React para una empresa de soluciones en inteligencia artificial. Diseñada con enfoque en experiencia de usuario y conversión, presenta los servicios de la empresa de forma clara, moderna y responsive. Incluye secciones informativas, llamados a la acción y un diseño visual alineado con la identidad corporativa, para potenciar la presencia digital de la marca.",
    "link": "https://oprosses.netlify.app/"
  },
  {
    "id": 5,
    "title": "Contactos",
    "subtitle": "Backend",
    "image": "5.png",
    "description": "API REST desarrollada con NestJS, TypeScript, TypeORM y MySQL para gestionar una agenda de contactos de forma segura. Incluye autenticación con JWT, cifrado de contraseñas con bcrypt y notificaciones por correo integradas mediante Nodemailer. Diseñada con una arquitectura limpia y escalable, garantizando eficiencia, modularidad y protección de datos personales.",
    "link": "https://github.com/juan1214s/contactos-back"
  },
  {
    "id": 7,
    "title": "API Libros",
    "subtitle": "Backend",
    "image": "6.png",
    "description": "Diseñé y desarrollé una API REST robusta utilizando .NET, implementando procedimientos almacenados para la gestión eficiente de datos. Apliqué autenticación segura mediante JWT y protegí las credenciales de usuario con bcrypt. Usé Dapper como ORM ligero para un acceso rápido a la base de datos. Además, seguí los principios SOLID para garantizar una arquitectura limpia, escalable y fácil de mantener.",
    "link": "https://github.com/juan1214s/Libros-Api"
  }
]
